# -*- coding: utf-8 -*-
"""
Created on Tue Dec 25 14:58:21 2018

@author: goodboyycb



"""
###  1 字符串的包含，in
## 2 os 以及 shutil 模块， os.listdir/os.rename/shutil.copy
## 3 copy(old,new)写出文件的全路径

import os
import shutil
m=0
d={1:"孙鑫",2:"穆士州",3:"王彦钢",4:"王斌斌",5:"徐阳",6:"孟玉",7:"徐长庆",8:"张波",
   9:"李鑫",10:"田登辉",11:"靳宗义",12:"李恒",13:"栗晓超",14:"姜广袤",15:"包纳百川",
   16:"张瑞",17:"付世琦",18:"李文强",19:"行路涛",20:"邵大江",21:"黄宇征",22:"刘望章",
   23:"张中斌",24:"叶尔那",25:"阿迪力江",26:"赵琳",27:"王丛丛",28:"尹朋然",
   29:"胡勤",30:"卢立芬",31:"荆鑫",32:"张玉叶",33:"温岩梦",34:"段梦雨",35:"秦肖伟",
   36:"刘清云",37:"苏晓笛",38:"杨桂英",39:"刘静",40:"李媛",41:"余晓宇",42:"吴媚华",
   43:"方思敏",44:"米合日班",45:"覃有富",46:"王翔",47:"尹洪鸣",48:"郭宇晨",
   49:"李金梁",50:"杨庆礼",51:"徐少波",52:"曹韬",53:"杨德健",54:"黄召",55:"路旭辉",
   56:"凌天航",57:"李佳霖",58:"蔡壮",59:"孙士良",60:"曹六旭",61:"顾锁",62:"卢可添",
   63:"王兆旭",64:"买马力甫",65:"孔亚慧",66:"陈树霞",67:"李星",68:"王楚",
   69:"魏翠霞",70:"刘文举",71:"刘成秋",72:"李忍忍",73:"杨翠婷",74:"吴洪伟",75:"张梦真",
   76:"崔存田",77:"郑月",78:"丁秀丽",79:"孙悦",80:"韩军良",81:"雷雪蕾",82:"米日努尔"}


dir1="E:/地信16-3"
dir2="E:/地信16-3-1"
for f in os.listdir(dir1):
    #print(f)
    for i in range(1,83):
     #   print(i)
        name=d[i]
        #print (name)
        if name in f:
            print(name,f)
            m+=1
            old=dir1+'/'+f
            new=dir2+'/'+str(i)+'_'+f
            print(old)
            print(new)
            shutil.copy(old,new)
            
print(m)